for <a href="https://github.com/MuratCelik3506/Data_Science_WorkSpace/blob/main/NoteBook/Python/Pandas/">  Pandas </a>
## My name is Murat Ã‡elik
    I am interested in Data Science 
    I am a student of Computer Science in Hacettepe University
 <a href="https://www.linkedin.com/in/muratcelik35/">
     Contact:

</a> 
<br><br>
<h4><b>Date</b><br></h4>
&nbsp;&nbsp;&nbsp;&nbsp;01/03/2021 : Created Pandas notebook

<img src="../Pandas/pandas.png" alt="Pandas" width="500" height="600">

# Hierarchical Indexing

In [3]:
import numpy as np
import pandas as pd

## A Multiply Indexed Series
to represent two-dimensional data within a one-dimensional Series
#### Good Way : Pandas MultiIndex

In [4]:
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]
index

[('California', 2000),
 ('California', 2010),
 ('New York', 2000),
 ('New York', 2010),
 ('Texas', 2000),
 ('Texas', 2010)]

In [6]:
# this is a bad way
pop = pd.Series(populations,index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [7]:
# We can create a multiIndex from the tuples
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [9]:
# If we reindex our series with this MultiIndex, we see the hierarchical representation of the data
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [10]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [11]:
type(pop)

pandas.core.series.Series

In [12]:
# We could easily have stored the same data using a simple DataFrame with index and column labels.
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [13]:
type(pop_df)

pandas.core.frame.DataFrame

In [14]:
pop_re_df = pop_df.stack()
pop_re_df

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [15]:
type(pop_re_df)

pandas.core.series.Series

In [16]:
pop_re_df == pop

California  2000    True
            2010    True
New York    2000    True
            2010    True
Texas       2000    True
            2010    True
dtype: bool

In [19]:
# For more flexibility in how the index is constructed, you can instead use the 
#                                                     class method constructors available in the pd.MultiIndex.
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [20]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [21]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [23]:
pop.index.names

FrozenList([None, None])

In [25]:
# Sometimes it is convenient to name the levels of the MultiIndex
pop.index.names = ["state","year"]
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### MultiIndex for columns

In [26]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.0  37.8  41.0  37.2  40.0  37.3
     2      39.0  35.4  24.0  36.8  35.0  35.8
2014 1      48.0  38.2  39.0  37.3  28.0  37.4
     2      52.0  36.2  38.0  36.7  50.0  36.2

#### Indexing and Slicing a MultiIndex

In [27]:
health_data["Sue"]

type          HR  Temp
year visit
2013 1      40.0  37.3
     2      35.0  35.8
2014 1      28.0  37.4
     2      50.0  36.2

In [32]:
health_data["Sue","HR"]

year  visit
2013  1        40.0
      2        35.0
2014  1        28.0
      2        50.0
Name: (Sue, HR), dtype: float64

In [33]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      46.0  37.8
     2      39.0  35.4

In [34]:
health_data.loc[:,("Bob","HR")]

year  visit
2013  1        46.0
      2        39.0
2014  1        48.0
      2        52.0
Name: (Bob, HR), dtype: float64

In [35]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [38]:
pop.sort_index(ascending=False)

state       year
Texas       2010    25145561
            2000    20851820
New York    2010    19378102
            2000    18976457
California  2010    37253956
            2000    33871648
dtype: int64

#### Stacking and unstacking indices

In [40]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [41]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [42]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [44]:
pop_flat = pop.reset_index(name="population")
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [45]:
pop_flat.set_index(["state","year"])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Data Aggregations on Multi-Indices

In [46]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.0  37.8  41.0  37.2  40.0  37.3
     2      39.0  35.4  24.0  36.8  35.0  35.8
2014 1      48.0  38.2  39.0  37.3  28.0  37.4
     2      52.0  36.2  38.0  36.7  50.0  36.2

In [49]:
data_mean = health_data.mean()
data_mean

subject  type
Bob      HR      46.250
         Temp    36.900
Guido    HR      35.500
         Temp    37.000
Sue      HR      38.250
         Temp    36.675
dtype: float64

In [50]:
data_mean = health_data.mean(level="year")
data_mean

subject   Bob       Guido         Sue
type       HR  Temp    HR  Temp    HR   Temp
year
2013     42.5  36.6  32.5  37.0  37.5  36.55
2014     50.0  37.2  38.5  37.0  39.0  36.80